Show / Hide Table of Contents
Enum CrossSectionType
Type of cross-section
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum CrossSectionType
Fields
 Name |  Description
 BeamShapeBox
Beam cross-section - Box
 BeamShapeBox1
Beam cross-section - Box - 1
 BeamShapeIHaunchChamfer
Beam cross-section - I haunch chamfer
 BeamShapeIHaunchChamferAssym
Beam cross-section - I haunch chamfer assymetric
 BeamShapeIrevDegen
Beam cross-section - I rev Degen
 BeamShapeIrevDegenAdd
Beam cross-section - I rev Degen Add
 BeamShapeIZDegen
Beam cross-section - IZ Degen
 BeamShapeLDegen
Beam cross-section - L Degen
 BeamShapeRevU
Beam cross-section - Rev U
 BeamShapeTrevDegen
Beam cross-section - T rev Degen
 BeamShapeTrevDegenAdd
Beam cross-section - T rev Degen Add
 BeamShapeTrevChamferHaunchD
Beam cross-section - T rev Chamfer Haunch D
 BeamShapeTrevChamferHaunchS
Beam cross-section - T rev Chamfer Haunch S
 BeamShapeZDegen
Beam cross-section - Z Degen
 Box2I
Box from double I rolled - II
 Box2L
Box welded from two rolled L-profiles
 Box2U
Box from double 2U
 Box2U2PI
Box from 2U and 2 Plates
 Box4L
Box section welded from 4 L-profiles
 BoxDelta
Welded box - delta shape
 BoxFl
Welded Box - contains two dominante flanges and two webs
 BoxTriangle
Welded box - triangular shape
 BoxWeb
Welded Box - contains two dominante flanges and two webs, bottom flange is inside between webs
 CF2Co
Cold formed - Pair 2C - opened (back to back)
 CF2Cpo
Cold formed - Pair 2C+ - opened (back to back)
 CFC
Cold formed thin-wall C section
 CFCp
Cold formed thin-wall C+ section
 CFGeneral
Cold formed - general shape
 CFL
Cold formed thin-wall angle section
 CFLgen
Cold formed - general angle section
 CFOmega
Cold formed thin-wall omega section
 CFRegPolygon
Cold formed thin-wall regular polygon
 CFSigma
Cold formed thin-wall sigma section
 CFU
Cold formed thin-wall Channel section
 CFZ
Cold formed thin-wall Z section
 CFZed
Cold formed thin-wall Z section with lips
 CompositeBeamBox
Hollow cross-section with composite slab
 CompositeBeamBox1
Hollow cross-section with composite slab
 CompositeBeamIgenT
I-shaped cross-section with composite slab
 CompositeBeamLLeft
Composite beam cross-section - L left
 CompositeBeamPlate
Composite slab
 CompositeBeamRResT
Composite beam cross-section - R res T
 CompositeBeamRResT1
Composite beam cross-section - R res T - 1
 CompositeBeamRT
Composite beam cross-section - R T
 CompositeBeamShapeChamf
I-shaped cross-section with composite slab
 CompositeBeamShapeChamfAssym
Assymetrical I-shaped cross-section with composite slab
 CompositeBeamShapeIgen
I-shaped cross-section with composite slab
 CompositeBeamShapeIT
I-shaped cross-section with composite slab
 CompositeBeamShapeITAssym
Assymetrical I-shaped cross-section with composite slab
 CompositeBeamShapeTT
Composite beam cross-section - TT
 CompositeBeamTLeft
Composite beam cross-section - T left
 CompositeBeamTrapezoid
Trapezoidal cross-section with composite slab
 CompositeBeamTresT
T-shaped cross-section with composite slab
 CompositeBeamTrev
T-shaped cross-section with composite slab
 CompositeBeamTrevResI
Composite beam cross-section - T rev res I
 CompositeBeamTrevResI1
Composite beam cross-section - T rev res I - 1
 CompositeBeamTrevResR
Composite beam cross-section - T rev res R
 CompositeBeamTrevResR1
Composite beam cross-section - T rev res R - 1
 CompositeBeamTrevT
Composite beam cross-section - T rev T
 General
General cross-section
 GeneralConcrete
General concrete cross-section
 GeneralSteel
General steel cross-section
 CHSg
Massive circular hollow section
 CHSPar
Parametric circular hollow section
 Igh
Massive symetrical I with web root chamfering
 Ign
Massive asymetrical I
 Iw
Welded I
 Iwn
Asymmetrical welded I
 Lg
Massive L
 LgMirrored
Mirrored Massive L
 O
Circular section
 OneComponentCss
Cross-section with one component without shape specification
 Oval
Oval shape
 Rect
Rectangular
 RHSg
Massive Rectangular hollow section
 Rolled2I
Pair rolled 2I
 RolledAngle
Rolled angle
 RolledDoubleLt
Composed double L rolled -
 RolledDoubleLu
Pair double L |_ _
 RolledDoubleUc
Composed double U rolled - []
 RolledDoubleUo
Composed double U rolled - ][
 RolledCHS
Rolled circular holow section
 RolledI
Rolled I
 RolledIPar
Rolled IPar - Parametrized I section
 RolledLPar
Rolled LPar - Parametrized Angle section
 RolledRHS
Rolled rectangular hollow setion
 RolledT
Rolled T
 RolledTI
T profile made from part of I profile
 RolledU
Rolled Channel
 RolledUPar
Rolled UPar - Parametrized Channel section
 Sg
Massive S section
 Tg
Massive T
 Tgrev
Massive T reverse
 Tchamfer1
Massive T chamfer 1
 Tchamfer2
Massive T chamfer 2
 Trapezoid
Trapezoid
 TT
TT section
 TT1
TT chamfer section
 Ttfh
Massive T with top flange haunch
 Ttfhrev
Massive T reverse with bottom flange haunch
 Tw
Welded T
 Twh
Massive T with wall haunch
 Twhrev
Massive T reverse with wall haunch
 Ug
Massive U
 UniqueName
Unique Name
 Zg
Massive Z section
 Improve this Doc
 View Source